runTestCases/initialCases/2.1_recDuct/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
4800
(
(-5.1 0.001 0.000900901)
(-5.1 0.001 0.00285702)
(-5.1 0.001 0.00514809)
(-5.1 0.001 0.00783112)
(-5.1 0.001 0.0109727)
(-5.1 0.001 0.0146507)
(-5.1 0.001 0.0189556)
(-5.1 0.001 0.0239934)
...
)
;

boundaryField
{
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
280
(
(-5.1 1.999 0)
(-5.1 1.99681 0)
(-5.1 1.99421 0)
(-5.1 1.99112 0)
(-5.1 1.98745 0)
(-5.1 1.9831 0)
(-5.1 1.97793 0)
(-5.1 1.97182 0)
...
)
;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
