runTestCases/initialCases/2.1_recDuct/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "6000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4800
(
(0.000115269 1.55883e-07 5.01377e-08)
(0.000337678 1.01505e-07 -7.16159e-08)
(0.000581209 6.20147e-08 -1.76491e-07)
(0.00085367 -1.48489e-08 1.37767e-07)
(0.00116138 -6.27498e-08 9.75641e-07)
(0.00151048 -9.8147e-08 2.54709e-06)
(0.0019074 -1.10346e-07 4.77189e-06)
(0.00235894 -9.79511e-08 7.47206e-06)
...
)
;

boundaryField
{
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
