runTestCases/initialCases/2.1_recDuct/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "6000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
4800
(
7.33809e-10
3.93942e-09
1.12101e-08
2.39771e-08
4.42585e-08
7.48047e-08
1.19282e-07
1.82512e-07
...
)
;

boundaryField
{
    wall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
280
(
7.34225e-10
3.86664e-09
1.1248e-08
2.44743e-08
4.59364e-08
7.89863e-08
1.28248e-07
2.00044e-07
...
)
;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
