runTestCases/initialCases/2.1_recDuct/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
( 
  "lib_FG_MoE_incompressibleRAS.so"
) ;


application     PysimpleFoam;

//startFrom       latestTime;
startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         6000;

deltaT          1;

writeControl    runTime;

writeInterval   100;//20000;

purgeWrite      5;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat              general;

timePrecision   6;

runTimeModifiable true;



functions
{

  turbulenceFields1
  {
    // Mandatory entries (unmodifiable)
    type            turbulenceFields;
    libs            (fieldFunctionObjects);
    fields           (R);
    enabled         false;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
  }

  yPlus
  {
    // Mandatory entries (unmodifiable)
    type            yPlus;
    libs            (fieldFunctionObjects);
    enabled         true;
    executeControl  timeStep;
    executeInterval 10;
    writeControl    writeTime;
  }


}