runTestCases/initialCases/2.1_recDuct/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pointSync false;

patches
(
    
    {
        // Name of new patch
        name inlet;

        // Type of new patch
        patchInfo
        {
            type        cyclic;
            neighbourPatch  outlet;
            transform translational;
            separationVector (0.2 0 0);
        }

        constructFrom  patches;
        patches (left);
        set f0;
    }

    {
        // Name of new patch
        name outlet;

        // Type of new patch
        patchInfo
        {
            type        cyclic;
            neighbourPatch  inlet;
            transform translational;
            separationVector (-0.2 0 0);
        }

        constructFrom  patches;
        patches (right);
        set f0;
    }
    
    );

// ************************************************************************* //

