runTestCases/initialCases/2.1_recDuct/system/extractPlane
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a surface, specified by one point and a normal direction.

\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

interpolationScheme	cellPoint;

surfaceFormat   raw;

fields  (U V k omega);

surfaces
(
s0
{
	type        plane;
	point    (-5.1 0 0);
  normal  (1 0 0);
  interpolate true;
  triangulate false;
}
) ;

// ************************************************************************* //
