runTestCases/initialCases/2.1_recDuct/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                  PCG;
        preconditioner          DIC;
        tolerance               1e-8;
        relTol                  0.01;
    }

    pFinal
    {
       $p;
       relTol               0.;
    }

    "(h|U|k|omega|e)"
    {
        solver              PBiCGStab;
        preconditioner      DILU;
        tolerance           1e-8;
        relTol              0.0;
    }

    "(h|U|k|omega|e)Final"
    {
        $U;
        relTol              0.;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        11;
    pRefValue       0;
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    /*
    residualControl
    {
        p           1e-3;
        U           1e-6;
        "(k|epsilon|omega)" 1e-6;
    }
    */

}

relaxationFactors
{
    fields
    {
        p        0.3;
    }
    equations
    {
        U        0.2;
        "(k|epsilon|omega)"   0.2;
    }
}


// ************************************************************************* //
